laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          coloque
seu copo                    Ligando
por favor espere            Preseleção
-   Açúcar   +           coloque
seu copo                    Bebida pronta
Retire seu copo       preparando
bebida nr. §1            §1
preparando                       insira
mudança exata                verifique o
moedor de café          Programação
OK                      Erro durante
programação            1= TEC ---> VMC
2= VMC ---> TEC     Programação
dados EAROM             Programação-----
RHEA FLASH------   reabasteça prod.
§1                 FILTRO ÁGUA
LIMPEZA 10=LIGAR        máquina
pronta                      Serviço de
Cartão                   inibido
----------------            Reset borra
de café = RESET         Reset borra
de café = P1             
                                  Crédito:
§1                         Fora de serviço
filtro de água      serviço
limpe o moedor              preço :    §1
                      fora de serviço
Grãos de café       nenhum produto
                     reabatec. Água
espere               espere
                             espere
temperatura                  fora de serviço
OFF §1 §2           máq. Desligada
§1:§2                ................
Começa:    §1:§2   TEST VEND
                          Aproveite seu
Favorito Aqui         Leite
Fresco                        messaggio 3
programmabile           Aproveite o
Delicioso Café          Delicioso Café
Sem a espera         insira moedas
                      temp. inst.  §1
                    a.t §1  t.v §2
temp.fria §3         Leitor de Cartão
Não conectado      - Audit. Dados -
Cycled Running     J A R R O
                          rheavendors
_                       coloque
seu copo                    num. Seleção
Leite F. OFF §1        Momento
para disfrutar              Bebida grátis
§1                    sem grãos café
DES.§1               mes 48
                             fora de serviço
sem água            encher água e
premir botão -1-      Hydrodynamic
Emptying phase         limpeza a vapor
automática          SERVIÇO
                            erro no código
CHAVE  §1            1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=Rinse
7=Gr 8=BC 9=Desc          1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Rinse
8=BC                      1-4=Rinse
                          Enxaguar   §1
§2                    Leitor RFID
conectado               Olá        §1
§2-§3-§4 §5 §6:§7     Insira a exato
quantidade           troque o
filtro de água             Proceda com
a limp.do moedor        vazio
borra de café                 DEF. PRODUTO
---- OK ----           INSTALAÇÃO
                         fim
instalação                      Crédito = 0
                        Coloque o
cartão                    Cartão de
seleção                   reabasteça prod.
REABASTECER CAFÉ   Não disponível
§1                   -  A Ç Ú C A R +
                   faça uma
seleção                    módulo porta
versão       §1        módulo café exp.
versão       §1    Módulo de leite
versão       §1     Periodic rinse
in §1 seconds         
OFF §1  §2                        Remova o copo
Por favor             aguarde carreg.
Depósito vapor      código de cartão
do cliente inv.    código de cartão
da máq. inválido   seleção
de sorte                    SÍMBOLO
                            espere por favor
Temp. vapor.       Preço :    §1
Créd. : §2            First coffee
in progress            esvaziando os
Grãos de café         remova
a bandeja                    insira
a bandeja                    descarga vapor
10=LIGAR             encher deterg.
10=LIGAR             filling water...
conduc.=§1 uS      encher água
10=LIGAR                descar. água
quente  10=LIGAR       Módulo de leite
Ligando...          Recipiente leite
vazio              P A R A R
                          Cartão de Rfid
Bloqueado            Enxágue o
Módulo de Leite           Limpeza com
deterg. 10=LIGAR        Cyclic Test
round #§1               Cyclic Test
Stopped!!!              lavar com água
fria    10=LIGAR     END Cleaning
with Detergent         FIM
lavagem vapor                   espere a limpeza
unidade do leite   O copo não está
na posição          motor regulagem
Por favor espere    §1
HOT WATER                        Warning products
level   low         
                                  Pegar café
Pres. bot. PROG           
reset autom.                      Fim
desinstal.                      Final Result:§1
KEY PRESS <PROG>    Tempo de limpeza
Milker atualiz.    ACION. TESTE
                       confirmar reset
parcial      P10    Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System halted
Please restart!       Empty the waste
liquid tank         Insert the waste
liquid tank        rinsing §1   §2
........uS=§3       Have you done
checks?>START/10      Clean.Deter.type
10=Tab 12=Liquid   check milk
                         Check Detergent
of the water mix    Milk Mod.Clean.:
check deter. §1    Cleaning §1  §2
........uS=§3       Dissolving
Detergent §1 §2          Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   check milk
presence                 check milk
quality                  check milk and
make cleaning        Gest. rhMM1.v+ ?
B1=Enable B2=no    Clean. rhMM1.v+
Time §1:§2 Ok=P1    Milk Mod.Clean.:
low deterg. §1     check tank cold
milk temperature    Available
                          Close  Coffee
KEY PRESS <PROG>      Open   Coffee
KEY PRESS <PROG>      1/13 Clean Grin.
1=Grin1; 2=Grin2   2/13 G§1 Close
shutter.  10=ok      3/13 Rem. brewer
& bean hop 10=ok   4/13 Inst. clean
device.    10=ok   5/13 Grinder
clean   10=start       Cycle §1 of §2
                     6/13 Rep. Clean
10=Yes; other=NO    7/13 Ref. Clean
device.    10=ok    8/13 Put back
bean hop.  10=ok      9/13 Open hopp.
shutter.  10=ok     10/13 Coffee
grind.  10=Start       Cycle §1 of §2
timeout §3 sec       11/13 Rep. Proc.
10=Yes; other=NO   12/13 Put back
Brewer.  10 = ok     13/13 Coffee?
10=Yes; other=NO      ESPRESSO
preparing                  Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           Bebida pronta
Retire seu copo       fora de serviço
sem água            Place your cup
and close flap       remova
a bandeja                    insira
a bandeja                    Please close the
flap               Enxágue o
Módulo de Leite           coloque
seu copo                    insira
mudança exata                verifique o
moedor de café          serviço
limpe o moedor              ................
Começa:    §1:§2   TEST VEND
                          Aproveite seu
Favorito Aqui         Delicioso Café
Em segundos          messaggio 3
programmabile           Aproveite o
Delicioso Café          Delicioso Café
Sem a espera         insira moedas
                      Proceda com
a limp.do moedor        vazio
borra de café                 FIM PROGRAMAÇÃO
aguardar......      cód. acesso
INIBIDO                 desinstalação
em curso...            
                                  CALIBRAÇÃO NÃO
É POSSÍVEL           Remover cafet
Premir bot. PROG      Subst. cafet.
Premir bot. PROG      Open boiler tap
10=start            PREMIR TECLA
>PROG<                 end uninstall
close boiler tap      Água OK ?
10= LIGAR                 ban. gotas
dentro? 10=LIGAR         ban. gotas
dentro? 10=LIGAR         remover borras
café    10=LIGAR     ban. gotas
vazio?  10=LIGAR         REGISTRO fora
de serviço            REGISTRO fora
de serviço            PROGRAMAÇÃO-----
----------------   Pré-seleção
não usada               PRODUTO  §1
0=inib.    §2.§3        tempo café
moedor §1 §2.§3          tempo café
moedor      §1.§2        Ent. Weight §1
1=Save  2=Repeat     Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=Rinse
8=BC 9=Desc               1-4=Rinse 5=Milk
8=BC               1-4=Rinse
7=grinder 8=BC            1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Mix 5=MilkMd
6=D.M 7=Gr. 8=BC   1-4=Mix 5=MilkMd
6=Desc.Milk 8=BC   ECON.ENERGIA
                       Crédito:
CartãoDeCrédito            Apresente
o cartão                  Calib. moedor
necessária            Refill   cups
                      Use own cups
                       